MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/src/hc32f46x_timer4_cnt.c
        enRet = Ok;
        switch (enIntType)
        {
        case Timer4CntZeroMatchInt:
            TMR4x->CVPR_f.ZIM = (uint16_t)enMaskTimes;
            break;
        case Timer4CntPeakMatchInt:
            TMR4x->CVPR_f.PIM = (uint16_t)enMaskTimes;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get Timer4 CNT interrupt mask times
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enIntType               Timer4 CNT interrupt type
 ** \arg Timer4CntZeroMatchIrq          Zero match interrupt of Timer4 CNT
 ** \arg Timer4CntPeakMatchIrq          Peak match interrupt of Timer4 CNT
 **
 ** \retval Timer4CntIntMask0           CNT interrupt flag is always set(not masked) for every CNT count at "0x0000" or peak.
 ** \retval Timer4CntIntMask1           CNT interrupt flag is set once for 2 every CNT counts at "0x0000" or peak (skiping 1 count).
 ** \retval Timer4CntIntMask2           CNT interrupt flag is set once for 3 every CNT counts at "0x0000" or peak (skiping 2 count).
 ** \retval Timer4CntIntMask3           CNT interrupt flag is set once for 4 every CNT counts at "0x0000" or peak (skiping 3 count).
 ** \retval Timer4CntIntMask4           CNT interrupt flag is set once for 5 every CNT counts at "0x0000" or peak (skiping 4 count).
 ** \retval Timer4CntIntMask5           CNT interrupt flag is set once for 6 every CNT counts at "0x0000" or peak (skiping 5 count).
 ** \retval Timer4CntIntMask6           CNT interrupt flag is set once for 7 every CNT counts at "0x0000" or peak (skiping 6 count).
 ** \retval Timer4CntIntMask7           CNT interrupt flag is set once for 8 every CNT counts at "0x0000" or peak (skiping 7 count).
 ** \retval Timer4CntIntMask8           CNT interrupt flag is set once for 9 every CNT counts at "0x0000" or peak (skiping 8 count).
 ** \retval Timer4CntIntMask9           CNT interrupt flag is set once for 10 every CNT counts at "0x0000" or peak (skiping 9 count).
 ** \retval Timer4CntIntMask10          CNT interrupt flag is set once for 11 every CNT counts at "0x0000" or peak (skiping 10 count).
 ** \retval Timer4CntIntMask11          CNT interrupt flag is set once for 12 every CNT counts at "0x0000" or peak (skiping 11 count).
 ** \retval Timer4CntIntMask12          CNT interrupt flag is set once for 13 every CNT counts at "0x0000" or peak (skiping 12 count).
 ** \retval Timer4CntIntMask13          CNT interrupt flag is set once for 14 every CNT counts at "0x0000" or peak (skiping 13 count).
 ** \retval Timer4CntIntMask14          CNT interrupt flag is set once for 15 every CNT counts at "0x0000" or peak (skiping 14 count).
 ** \retval Timer4CntIntMask15          CNT interrupt flag is set once for 16 every CNT counts at "0x0000" or peak (skiping 15 count).
 **
 ******************************************************************************/
en_timer4_cnt_int_mask_t TIMER4_CNT_GetIntMaskTimes(M4_TMR4_TypeDef *TMR4x,
                                                    en_timer4_cnt_int_t enIntType)
{
    uint16_t u16MaskTimes = 0u;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4(TMR4x));
    DDL_ASSERT(IS_VALID_CNT_INT_TYPE(enIntType));

    switch (enIntType)
    {
    case Timer4CntZeroMatchInt:
        u16MaskTimes = TMR4x->CVPR_f.ZIM;
        break;
    case Timer4CntPeakMatchInt:
        u16MaskTimes = TMR4x->CVPR_f.PIM;
        break;
    default:
        break;
    }

    return (en_timer4_cnt_int_mask_t)u16MaskTimes;
}

//@} // Timer4CntGroup

#endif /* DDL_TIMER4_CNT_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
